BREAKS:
* Breaks [0/2]:
** TODO Go out on an Errand expected: 1hr
   :LOGBOOK:
   CLOCK: [2016-11-28 Mon 18:00]--[2016-11-28 Mon 19:00] =>  1:00
   :END:
** TODO Make coffee: Expected 2min

* Create E-commerce app for Flow [1/9]
** DONE Setup Laravel [6/6]
*** DONE Initiate Git Repo
    :PROPERTIES:
    :ORDERED:  t
    :END:
    :LOGBOOK:
    CLOCK: [2016-11-28 Mon 16:43]--[2016-11-28 Mon 16:45] =>  0:02
    :END:
*** DONE Set Permissions on Storage
    :LOGBOOK:
    CLOCK: [2016-11-28 Mon 16:45]--[2016-11-28 Mon 16:46] =>  0:01
    :END:
*** DONE Set Permissions on Bootstrap
    :LOGBOOK:
    CLOCK: [2016-11-28 Mon 16:46]--[2016-11-28 Mon 16:47] =>  0:01
    :END:
*** DONE Setup Database
    :LOGBOOK:
    CLOCK:  [2016-11-28 Mon 16:47]--[2016-11-28 Mon 16:48] =>  0:01
    :END:
*** DONE Setup Environment
    :LOGBOOK:
    CLOCK: [2016-11-28 Mon 16:48]--[2016-11-28 Mon 16:49] =>  0:01
    :END:
*** DONE Setup Routes File for Categories
    :LOGBOOK:
    CLOCK: [2016-11-28 Mon 17:30]--[2016-11-28 Mon 17:32] =>  0:02
    :END:
** TODO Categories [4/6]
   :LOGBOOK:
   CLOCK: [2016-11-28 Mon 20:00]--[2016-11-28 Mon 21:00] =>  1:00
   :END:
*** DONE Flesh out the CatsController
    :LOGBOOK:
    CLOCK: [2016-11-29 Tue 12:30]--[2016-11-29 Tue 13:00] =>  0:30
    :END:
*** TODO Categories can have many child categories.
    :LOGBOOK:
    CLOCK: [2016-11-29 Tue 13:00]--[2016-11-29 Tue 13:10] =>  0:10
    :END:
*** DONE Each Category should be Unique and have an ID assigned.
    :LOGBOOK:
    CLOCK: [2016-11-29 Tue 13:10]--[2016-11-29 Tue 13:20] =>  0:10
    :END:
*** DONE Categories don't need to be dated or timed.
    :LOGBOOK:
    CLOCK: [2016-11-29 Tue 13:20]--[2016-11-29 Tue 13:40] =>  0:20
    :END:
*** DONE Category should have a description
    :LOGBOOK:
    CLOCK: [2016-11-29 Tue 13:40]--[2016-11-29 Tue 14:00] =>  0:20
    :END:
*** TODO Category should have a slug for SEO.
    :LOGBOOK:
    CLOCK: [2016-11-30 Wed 11:46]--[2016-11-30 Wed 11:46] =>  0:00
    :END:
** TODO Category Listings [2/3]
*** DONE Category Listing should grab the ID of a child category and list all products
     :LOGBOOK:
    CLOCK: [2016-11-29 Tue 15:00]--[2016-11-29 Tue 16:00] =>  1:00
    :END:
*** DONE A Category Can Have Many Products
    :LOGBOOK:
    CLOCK: [2016-11-29 Tue 19:00]--[2016-11-29 Tue 22:00] =>  3:00
    :END:
**** Time is due to bug fixing and researching. 
** TODO Products [1/1]
*** DONE Name, Description, Price, Cat ID, Slug, TIMESTAMPS,
     :LOGBOOK:
     CLOCK: [2016-11-29 Tue 22:00]--[2016-11-29 Tue 23:00] =>  1:00
     :END:
** TODO Checkout [0/2]
*** TODO User should be able to review their purchase before clicking the continue button.
*** TODO Once reviewed process fake payment so Order Success can return true or false
** TODO Order Success [0/3]
*** TODO If order success returns true forward them to order success page.
*** TODO If order success returns false send them back to the page they were at and show errors.
*** TODO Email the User upon Order Success
** TODO Write Tests [0/6]
*** TODO Test the Categories
*** TODO Test the Listings
*** TODO Test Product View
*** TODO Test Search
*** TODO Test the Checkout
*** TODO Test Order Success
